{"id":113415,"type":"ANIME","title":{"romaji":"Jujutsu Kaisen","english":"JUJUTSU KAISEN","native":"呪術廻戦"},"coverImage":{"extraLarge":"https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx113415-bbBWj4pEFseh.jpg","large":"https://s4.anilist.co/file/anilistcdn/media/anime/cover/medium/bx113415-bbBWj4pEFseh.jpg","color":"#e45d5d"},"startDate":{"year":2020,"month":10,"day":3},"endDate":{"year":2021,"month":3,"day":27},"bannerImage":"https://s4.anilist.co/file/anilistcdn/media/anime/banner/113415-jQBSkxWAAk83.jpg","season":"FALL","seasonYear":2020,"description":"A boy fights... for \"the right death.\"<br>\n<br>\nHardship, regret, shame: the negative feelings that humans feel become Curses that lurk in our everyday lives. The Curses run rampant throughout the world, capable of leading people to terrible misfortune and even death. What's more, the Curses can only be exorcised by another Curse.<br>\n<br>\nItadori Yuji is a boy with tremendous physical strength, though he lives a completely ordinary high school life. One day, to save a friend who has been attacked by Curses, he eats the finger of the Double-Faced Specter, taking the Curse into his own soul. From then on, he shares one body with the Double-Faced Specter. Guided by the most powerful of sorcerers, Gojou Satoru, Itadori is admitted to the Tokyo Metropolitan Technical High School of Sorcery, an organization that fights the Curses... and thus begins the heroic tale of a boy who became a Curse to exorcise a Curse, a life from which he could never turn back.\n<br><br>\n(Source: Crunchyroll)<br>\n<br>\n<i>Note: The first episode received an early web premiere on September 19th, 2020. The regular TV broadcast started on October 3rd, 2020.</i>","format":"TV","status":"FINISHED","episodes":24,"duration":24,"chapters":null,"volumes":null,"favourites":42343,"trending":21,"genres":["Action","Drama","Supernatural"],"isAdult":false,"averageScore":86,"popularity":514982,"trailer":{"id":"VpO6APNqY1c","site":"youtube"}}